nxp-mcuxpresso/mcux-component/power_manager/devices/KW47B42ZB7/fsl_pm_device.c
/*
 * Copyright 2024-2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <setjmp.h>

#include "fsl_pm_core.h"
#include "fsl_pm_device.h"

#include "fsl_cmc.h"
#include "fsl_spc.h"
#include "fsl_wuu.h"
#include "fsl_clock.h"
#include "fsl_crc.h"
#include "fsl_vbat.h"

/*
 * $Coverage Justification Reference$
 *
 * $Justification pm_device_c_ref_1$
 * Following lines added to avoid MISRA violations and will never hit.
 *
 * $Justification pm_device_c_ref_2$
 * Set chip in low-power modes will disconnect debugger and it is unable to get coverage data.
 *
 * $Justification pm_device_c_ref_3$
 * Following lines will power off selected RAM block and it is unable to get coverage data.
 *
 * $Justification pm_device_c_ref_4$
 * Configuration-dependent branch. Reaching the alternate direction requires a specific resource
 * operate-mode or WUU module/pin enable-register state combination that the functional unit test
 * does not drive; it only occurs with low-power resource/wakeup configurations not produced by
 * the test scenarios.
 */

/*******************************************************************************
 * Macros
 ******************************************************************************/
#define WUU_PIN_FLAG_MASK                                                                                              \
    (WUU_PF_WUF0_MASK | WUU_PF_WUF1_MASK |WUU_PF_WUF2_MASK | WUU_PF_WUF3_MASK | WUU_PF_WUF4_MASK | WUU_PF_WUF5_MASK | \
    WUU_PF_WUF6_MASK | WUU_PF_WUF7_MASK | WUU_PF_WUF8_MASK | WUU_PF_WUF9_MASK | WUU_PF_WUF10_MASK | WUU_PF_WUF11_MASK |\
    WUU_PF_WUF12_MASK | WUU_PF_WUF13_MASK | WUU_PF_WUF14_MASK | WUU_PF_WUF15_MASK | WUU_PF_WUF16_MASK | \
    WUU_PF_WUF17_MASK | WUU_PF_WUF18_MASK | WUU_PF_WUF19_MASK | WUU_PF_WUF20_MASK | WUU_PF_WUF21_MASK | \
    WUU_PF_WUF22_MASK | WUU_PF_WUF23_MASK | WUU_PF_WUF24_MASK | WUU_PF_WUF25_MASK | WUU_PF_WUF26_MASK | \
    WUU_PF_WUF27_MASK | WUU_PF_WUF28_MASK)

/*******************************************************************************
 * Prototypes
 ******************************************************************************/
typedef struct _pm_resource_recode pm_resource_recode_t;

static void PM_WakeupFunction(void);
static void PM_EnterLowPowerMode(uint8_t stateIndex, pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup);
static void PM_CleanExitLowPowerMode(void);
static uint8_t PM_FindOperateMode(uint32_t rescIndex, pm_resc_group_t *pSysRescGroup);
static void PM_SetRAMOperateMode(uint8_t operateMode, pm_resource_recode_t *pResourceRecode);
static void PM_SetFro192MOperateMode(uint8_t operateMode, pm_resource_recode_t *pResourceRecode);
static void PM_SetWakePowerDomainOperateMode(uint8_t operateMode, pm_resource_recode_t *pResourceRecode);
static void PM_SaveRuntimeContext(void);
static void PM_RestoreRuntimeContext(void);

static void PM_EnableBasicResources(pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup);

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
static status_t PM_ManageWakeupSource(pm_wakeup_source_t *ws, bool enable);
static bool PM_IsWakeupSource(pm_wakeup_source_t *ws);
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*!
 *  |  Module  |    Sleep     | Deep Sleep | Power Down | Deep Power Down |
 *  |  CM33    |    Static    | Static     |    OFF     |       OFF       |
 *  | FRO-192M |   Optional   |    OFF     |    OFF     |       OFF       |
 *  | FRO-6M   |   Optional   |  Optional  |   Optional |       OFF       |
 *  | FRO-32K  |      ON      |     ON     |   Optional |     Optional    |
 *  | OSC-RTC  |      ON      |     ON     |   Optional |     Optional    |
 *  | OSC-RF   |      ON      |  Optional  |   Optional |       OFF       |
 *  |   SCG    |      ON      |   Static   |    Static  |       OFF       |
 *  |   PCC    |      ON      |   Static   |    OFF     |       OFF       |
 *  |  Flash   |  Optional LP |    OFF/LP  |    OFF     |       OFF       |
 *  |  SRAMx   |   Optional   |   Optional |   Optional |       OFF       |
 *  |  DCDC    |  Optional LP |  ON, LP or OFF | ON, LP or OFF | OFF |
 *  |  LDO-CORE | Optional LP |  ON, LP or OFF | ON, LP or OFF | OFF |
 *  |  LDO-SYS  | Optional LP |  ON, LP | ON, LP | ON, LP |
 *  |  VDD_CORE HVD | Optional | Optional | Optional | OFF |
 *  |  VDD_CORE LVD | Optional | Optional | Optional | OFF |
 *  |  VDD_IO_ABC HVD | Optional | Optional | Optional | OFF |
 *  |  VDD_IO_ABC LVD | Optional | Optional | Optional | OFF |
 *  |  VDD_SYS HVD    | Optional | Optional | Optional | OFF |
 *  |  VDD_SYS LVD    | Optional | Optional | Optional | OFF |
 */
#define PM_SLEEP_FIX_CONSTR_MASK (PM_RESC_TO_BIT(kResc_CoreClk))
#define PM_SLEEP_VAR_CONSTR_MASK (PM_RESC_TO_BIT(kResc_CTCM0) | PM_RESC_TO_BIT(kResc_CTCM1) | \
                        PM_RESC_TO_BIT(kResc_STCM0) | PM_RESC_TO_BIT(kResc_STCM1) | PM_RESC_TO_BIT(kResc_STCM2) |\
                        PM_RESC_TO_BIT(kResc_STCM3) | PM_RESC_TO_BIT(kResc_STCM4) | PM_RESC_TO_BIT(kResc_STCM5) | \
                        PM_RESC_TO_BIT(kResc_STCM6) | PM_RESC_TO_BIT(kResc_STCM7) | PM_RESC_TO_BIT(kResc_STCM8) | \
                        PM_RESC_TO_BIT(kResc_Fro192M) | PM_RESC_TO_BIT(kResc_WakePowerDomainPeri) | \
                        PM_RESC_TO_BIT(kResc_BusSysClk))

#define PM_DS_FIX_CONSTR_MASK   (PM_RESC_TO_BIT(kResc_CoreClk) | PM_RESC_TO_BIT(kResc_BusSysClk) |\
                                PM_RESC_TO_BIT(kResc_MainPowerDomainPeriOpt2) | PM_RESC_TO_BIT(kResc_Fro192M))
#define PM_DS_VAR_CONSTR_MASK (PM_RESC_TO_BIT(kResc_CTCM0) | PM_RESC_TO_BIT(kResc_CTCM1) | \
                        PM_RESC_TO_BIT(kResc_STCM0) | PM_RESC_TO_BIT(kResc_STCM1) | PM_RESC_TO_BIT(kResc_STCM2) |\
                        PM_RESC_TO_BIT(kResc_STCM3) | PM_RESC_TO_BIT(kResc_STCM4) | PM_RESC_TO_BIT(kResc_STCM5) | \
                        PM_RESC_TO_BIT(kResc_STCM6) | PM_RESC_TO_BIT(kResc_STCM7) | PM_RESC_TO_BIT(kResc_STCM8) | \
                        PM_RESC_TO_BIT(kResc_WakePowerDomainPeri))

#define PM_PD_FIX_CONSTR_MASK (PM_RESC_TO_BIT(kResc_CoreClk) | PM_RESC_TO_BIT(kResc_BusSysClk) | \
                            PM_RESC_TO_BIT(kResc_MainPowerDomainPeriOpt1) | \
                            PM_RESC_TO_BIT(kResc_MainPowerDomainPeriOpt2) | PM_RESC_TO_BIT(kResc_Fro192M))
#define PM_PD_VAR_CONSTR_MASK (PM_RESC_TO_BIT(kResc_CTCM0) | PM_RESC_TO_BIT(kResc_CTCM1) | \
                        PM_RESC_TO_BIT(kResc_STCM0) | PM_RESC_TO_BIT(kResc_STCM1) | PM_RESC_TO_BIT(kResc_STCM2) |\
                        PM_RESC_TO_BIT(kResc_STCM3) | PM_RESC_TO_BIT(kResc_STCM4) | PM_RESC_TO_BIT(kResc_STCM5) | \
                        PM_RESC_TO_BIT(kResc_STCM6) | PM_RESC_TO_BIT(kResc_STCM7) | PM_RESC_TO_BIT(kResc_STCM8) | \
                        PM_RESC_TO_BIT(kResc_WakePowerDomainPeri))

#define PM_DPD_FIX_CONSTR_MASK (PM_RESC_TO_BIT(kResc_CoreClk) | PM_RESC_TO_BIT(kResc_BusSysClk) | \
                            PM_RESC_TO_BIT(kResc_MainPowerDomainPeriOpt1) | \
                            PM_RESC_TO_BIT(kResc_MainPowerDomainPeriOpt2) | PM_RESC_TO_BIT(kResc_Fro192M) | \
                            PM_RESC_TO_BIT(kResc_CTCM0) | PM_RESC_TO_BIT(kResc_CTCM1) | PM_RESC_TO_BIT(kResc_STCM0) | \
                            PM_RESC_TO_BIT(kResc_STCM1) | PM_RESC_TO_BIT(kResc_STCM2) | PM_RESC_TO_BIT(kResc_STCM3) | \
                            PM_RESC_TO_BIT(kResc_STCM4) | PM_RESC_TO_BIT(kResc_STCM5) | PM_RESC_TO_BIT(kResc_STCM6) | \
                            PM_RESC_TO_BIT(kResc_STCM7))
#define PM_DPD_VAR_CONSTR_MASK (PM_RESC_TO_BIT(kResc_WakePowerDomainPeri) | PM_RESC_TO_BIT(kResc_STCM8))

extern const pm_device_option_t g_devicePMOption; /* MISRA Rule 8.4: compatible declaration before definition */
const pm_device_option_t g_devicePMOption = {
    .states =
        {
            /* Sleep */
            {
                .exitLatency = 140U, /* 140 us */
                .fixConstraintsMask =
                    {
                        .rescMask[0U] = PM_SLEEP_FIX_CONSTR_MASK,
                    },
                .varConstraintsMask =
                    {
                        .rescMask[0U] = PM_SLEEP_VAR_CONSTR_MASK,
                    },
            },
            /* Deep Sleep */
            {
                .exitLatency = 140U, /* 140 us */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = PM_DS_FIX_CONSTR_MASK,
                    },
                .varConstraintsMask =
                    {
                        .rescMask[0] = PM_DS_VAR_CONSTR_MASK,
                    },
            },
            /* Power Down */
            {
                .exitLatency = 600U, /* 600 us */
                .fixConstraintsMask =
                    {
                        .rescMask[0] = PM_PD_FIX_CONSTR_MASK,
                    },
                .varConstraintsMask =
                    {
                        .rescMask[0] = PM_PD_VAR_CONSTR_MASK,
                    },
            },
            /* Deep Power Down */
            {
                .fixConstraintsMask =
                    {
                        .rescMask[0] = PM_DPD_FIX_CONSTR_MASK,
                    },
                .varConstraintsMask =
                    {
                        .rescMask[0] = PM_DPD_VAR_CONSTR_MASK,
                    },
            },
        },
    .stateCount = 4U,
    .enter      = PM_EnterLowPowerMode,
    .clean      = PM_CleanExitLowPowerMode,

#if (defined(FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER) && FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER)
    .manageWakeupSource = PM_ManageWakeupSource,
    .isWakeupSource     = PM_IsWakeupSource,
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */
};

