nxp-mcuxpresso/mcux-component/power_manager/devices/KW47B42ZB7/fsl_pm_device.c
struct _pm_resource_recode
{
    uint8_t defaultOperateMode : 4U;
    uint8_t currentOperateMode : 4U;
    void (*resourceConfigFunc)(uint8_t operateMode, pm_resource_recode_t *pResourceRecode);
};

AT_ALWAYS_ON_DATA_INIT(static pm_resource_recode_t resourceDB[PM_CONFIGURABLE_RESOURCE_COUNT]) = {
    {PM_RESOURCE_OFF, 0U, PM_SetRAMOperateMode},    /* CTCM0 */
    {PM_RESOURCE_OFF, 0U, PM_SetRAMOperateMode},    /* CTCM1 */
    {PM_RESOURCE_OFF, 0U, PM_SetRAMOperateMode},    /* STCM0 */
    {PM_RESOURCE_OFF, 0U, PM_SetRAMOperateMode},    /* STCM1 */
    {PM_RESOURCE_OFF, 0U, PM_SetRAMOperateMode},    /* STCM2 */
    {PM_RESOURCE_OFF, 0U, PM_SetRAMOperateMode},    /* STCM3 */
    {PM_RESOURCE_OFF, 0U, PM_SetRAMOperateMode},    /* STCM4 */
    {PM_RESOURCE_OFF, 0U, PM_SetRAMOperateMode},    /* STCM5 */
    {PM_RESOURCE_OFF, 0U, PM_SetRAMOperateMode},    /* STCM6 */
    {PM_RESOURCE_OFF, 0U, PM_SetRAMOperateMode},    /* STCM7 */
    {PM_RESOURCE_FULL_ON, 0U, PM_SetRAMOperateMode},    /* STCM8 */
    {PM_RESOURCE_OFF, 0U, PM_SetFro192MOperateMode},
    {PM_RESOURCE_FULL_ON, PM_RESOURCE_FULL_ON, PM_SetWakePowerDomainOperateMode},
};

AT_ALWAYS_ON_DATA_INIT(static cmc_power_domain_config_t g_mainWakePDConfig) = {
    .clock_mode = kCMC_GateAllSystemClocksEnterLowPowerMode,
    /* we chose to put the main and wake domain in retention (deep sleep) by default if no constraints are set */
    .main_domain = kCMC_DeepSleepMode,
    .wake_domain = kCMC_DeepSleepMode,
};

AT_ALWAYS_ON_DATA(static uint32_t primask_mask);
AT_ALWAYS_ON_DATA(static uint32_t basepri_mask);
AT_ALWAYS_ON_DATA(static jmp_buf g_coreContext);
AT_ALWAYS_ON_DATA(static uint32_t g_scbVtor);
AT_ALWAYS_ON_DATA(static uint32_t g_scbIcsr);
AT_ALWAYS_ON_DATA(static uint32_t g_scbAircr);
AT_ALWAYS_ON_DATA(static uint32_t g_scbCCR);
AT_ALWAYS_ON_DATA(static uint8_t g_scbShp[12]);
AT_ALWAYS_ON_DATA(static uint32_t g_scbShcsr);
AT_ALWAYS_ON_DATA(static uint32_t g_nvicIser[16U]);
AT_ALWAYS_ON_DATA(static uint8_t g_nvicIp[496U]);
AT_ALWAYS_ON_DATA(static uint32_t g_systickCtrl);
AT_ALWAYS_ON_DATA(static uint32_t g_systickLoad);
AT_ALWAYS_ON_DATA(static uint32_t g_cpuControl);
AT_ALWAYS_ON_DATA(static uint32_t g_wakeupEntry[12]);
AT_ALWAYS_ON_DATA(static uint32_t crcResult);

extern uint32_t m_warmboot_stack_end;

/*******************************************************************************
 * Code
 ******************************************************************************/
static void PM_EnterLowPowerMode(uint8_t stateIndex, pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup)
{
    uint8_t rescMaskArrayIndex = 0U;
    uint8_t rescMaskOffset     = 0U;

    switch (stateIndex) /* GCOVR_EXCL_BR_LINE */
    {
        case PM_LP_STATE_SLEEP:
        {
            rescMaskArrayIndex = ((uint8_t)kResc_BusSysClk) / 32U;
            rescMaskOffset     = ((uint8_t)kResc_BusSysClk) % 32U;
            if ((pSoftRescMask->rescMask[rescMaskArrayIndex] & (1UL << rescMaskOffset)) != 0UL)
            {
                g_mainWakePDConfig.clock_mode    = kCMC_GateCoreClock;
                g_mainWakePDConfig.main_domain   = kCMC_ActiveMode;
                g_mainWakePDConfig.wake_domain   = kCMC_ActiveMode;
                resourceDB[(uint8_t)kResc_WakePowerDomainPeri].currentOperateMode = PM_RESOURCE_FULL_ON;
                pSoftRescMask->rescMask[rescMaskArrayIndex] &= ~(1UL << rescMaskOffset);
            }
            else
            {
                g_mainWakePDConfig.clock_mode    = kCMC_GateAllSystemClocksEnterLowPowerMode;
                g_mainWakePDConfig.main_domain   = kCMC_SleepMode;
                g_mainWakePDConfig.wake_domain   = kCMC_SleepMode;
                resourceDB[(uint8_t)kResc_WakePowerDomainPeri].currentOperateMode = PM_RESOURCE_PARTABLE_ON2;
            }
            break;
        }

        case PM_LP_STATE_DEEP_SLEEP:
        {
            g_mainWakePDConfig.clock_mode    = kCMC_GateAllSystemClocksEnterLowPowerMode;
            g_mainWakePDConfig.main_domain   = kCMC_DeepSleepMode;
            g_mainWakePDConfig.wake_domain   = kCMC_DeepSleepMode;
            resourceDB[(uint8_t)kResc_WakePowerDomainPeri].currentOperateMode = PM_RESOURCE_PARTABLE_ON1;
            break;
        }

        case PM_LP_STATE_POWER_DOWN:
        {
            g_mainWakePDConfig.clock_mode    = kCMC_GateAllSystemClocksEnterLowPowerMode;
            g_mainWakePDConfig.main_domain   = kCMC_PowerDownMode;
            g_mainWakePDConfig.wake_domain   = kCMC_PowerDownMode;
            resourceDB[(uint8_t)kResc_WakePowerDomainPeri].currentOperateMode = PM_RESOURCE_OFF;
            break;
        }

        case PM_LP_STATE_DEEP_POWER_DOWN:
        {
            g_mainWakePDConfig.clock_mode    = kCMC_GateAllSystemClocksEnterLowPowerMode;
            g_mainWakePDConfig.main_domain   = kCMC_DeepPowerDown;
            g_mainWakePDConfig.wake_domain   = kCMC_DeepPowerDown;
            resourceDB[(uint8_t)kResc_WakePowerDomainPeri].currentOperateMode = PM_RESOURCE_OFF;
            break;
        }

        /*
         * $Line Coverage Justification$
         * $ref pm_device_c_ref_1$.
         */
        default: /* GCOVR_EXCL_START */
        {
            /* This branch should never be hit. */
            break;
        } /* GCOVR_EXCL_STOP */
    }
    PM_EnableBasicResources(pSoftRescMask, pSysRescGroup);
    CMC_SetPowerModeProtection(CMC0, (uint32_t)kCMC_AllowAllLowPowerModes);

    if ((stateIndex == PM_LP_STATE_SLEEP) || (stateIndex == PM_LP_STATE_DEEP_SLEEP))
    {
#if (defined(FSL_PM_SUPPORT_LP_TIMER_CONTROLLER) && FSL_PM_SUPPORT_LP_TIMER_CONTROLLER)
        PM_RecordAndStartTimer();
#endif /* FSL_PM_SUPPORT_LP_TIMER_CONTROLLER */
        if (g_mainWakePDConfig.clock_mode == kCMC_GateCoreClock)
        {
            /* This configuration corresponds to WFI only, only the core clock will be gated */
            CMC_SetClockMode(CMC0, g_mainWakePDConfig.clock_mode);
            CMC_SetMAINPowerMode(CMC0, g_mainWakePDConfig.main_domain);
            CMC_SetWAKEPowerMode(CMC0, g_mainWakePDConfig.wake_domain);
            SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;
            __DSB();
            __WFI();
            __ISB();
        }
        else
        {
            CMC_EnterLowPowerMode(CMC0, &g_mainWakePDConfig);
        }
#if (defined(FSL_PM_SUPPORT_LP_TIMER_CONTROLLER) && FSL_PM_SUPPORT_LP_TIMER_CONTROLLER)
        PM_StopAndRecordTimer();
#endif /* FSL_PM_SUPPORT_LP_TIMER_CONTROLLER */
    }
    else
    {
        /*
         * $Branch Coverage Justification$
         * $ref pm_device_c_ref_2$.
         */
        if (g_mainWakePDConfig.wake_domain <= g_mainWakePDConfig.main_domain) /* GCOVR_EXCL_BR_LINE */
        {
            /* The first word from wakeup address must be SP */
            g_wakeupEntry[0] = ((uint32_t)&m_warmboot_stack_end);

            /* The second word from wakeup address must be PC. */
            g_wakeupEntry[1] = (uint32_t)PM_WakeupFunction;

