nxp-mcuxpresso/mcux-component/power_manager/devices/KW47B42ZB7/fsl_pm_device.c
            /*
             * $Branch Coverage Justification$
             * $ref pm_device_c_ref_4$.
             */
            if (disableWuuIrq == true) /* GCOVR_EXCL_BR_LINE */
            {
                (void)DisableIRQ(WUU0_IRQn);
            }
        }
    }
    else
    {
        if (enable)
        {
            /* Wakeup source is internal module. */
            (void)EnableIRQ(WUU0_IRQn);

            WUU_SetInternalWakeUpModulesConfig(WUU0, (uint8_t)inputId, (wuu_internal_wakeup_module_event_t)misc);
            /*
             * $Branch Coverage Justification$
             * $ref pm_device_c_ref_4$.
             */
            if (misc == (uint32_t)kWUU_InternalModuleInterrupt) /* GCOVR_EXCL_BR_LINE */
            {
                (void)EnableIRQ((IRQn_Type)irqn);
            }
        }
        else
        {
            WUU_ClearInternalWakeUpModulesConfig(WUU0, (uint8_t)inputId, (wuu_internal_wakeup_module_event_t)misc);
            if (misc == (uint32_t)kWUU_InternalModuleInterrupt)
            {
                (void)DisableIRQ((IRQn_Type)irqn);
                /*
                 * $Branch Coverage Justification$
                 * $ref pm_device_c_ref_4$.
                 */
                if (WUU0->ME == 0UL) /* GCOVR_EXCL_BR_LINE */
                {
                    disableWuuIrq = true;
                }
            }
            else
            {
                /*
                 * $Branch Coverage Justification$
                 * $ref pm_device_c_ref_4$.
                 */
                if (WUU0->DE == 0UL) /* GCOVR_EXCL_BR_LINE */
                {
                    disableWuuIrq = true;
                }
            }
            /*
             * $Branch Coverage Justification$
             * $ref pm_device_c_ref_4$.
             */
            if (disableWuuIrq) /* GCOVR_EXCL_BR_LINE */
            {
                (void)DisableIRQ(WUU0_IRQn);
            }
        }
    }

    return kStatus_Success;
}

static bool PM_IsWakeupSource(pm_wakeup_source_t *ws)
{
    uint32_t inputType;
    uint32_t inputId;
    uint32_t irqn;
    uint32_t misc;
    uint32_t wuuPf;
    uint32_t mask;
    bool ret = false;

    assert(ws != NULL);

    PM_DECODE_WAKEUP_SOURCE_ID(ws->wsId);

    /* Wakeup source is external pin. */
    /*
     * $Branch Coverage Justification$
     * $ref pm_device_c_ref_4$.
     */
    if (inputType == 0UL) /* GCOVR_EXCL_BR_LINE */
    {
        wuuPf = WUU_GetExternalWakeUpPinsFlag(WUU0);
        mask  = (1UL << inputId) & WUU_PIN_FLAG_MASK;

        if ((wuuPf & mask) != 0UL) /* GCOVR_EXCL_BR_LINE */
        {
            /*
             * $Line Coverage Justification$
             * $ref pm_device_c_ref_2$.
             */
            /* This wake up source triggered the last wake up */
            ret = true; /* GCOVR_EXCL_LINE */
        }
    }

    (void)irqn;
    (void)misc;

    return ret;
}
#endif /* FSL_PM_SUPPORT_WAKEUP_SOURCE_MANAGER */
